[
  {
    "title": "Convert 'Zero' and 'One' to '1' and '0'",
    "description": "Create a function that takes a string as an argument. The function must return a string containing 1s and 0s based on the string argument's words. If any word in the argument is not equal to 'zero or 'one' (case insensitive), you should ignore it. The returned string's length should be a multiple of 8, if the string is not a multiple of 8 you should remove the numbers in excess.",
    "link": "https://edabit.com/challenge/iKRmj2Q6GQHkAXXxf",
    "tags": [ "Arrays", "Formatting", "Logic", "Loops" ]
  },
  {
    "title": "Instances of the Fibonacci Sequence",
    "description": "Create a function that takes a number as an argument and returns n instances of the Fibonacci sequence as an array.",
    "link": "https://edabit.com/challenge/PeDpzoeGyv9TfF5G5",
    "tags": [ "Arrays", "Algorithms", "Numbers", "Loops" ]
  },
  {
    "title": "Seven Boom!",
    "description": "Create a function that takes an array of numbers and return \"Boom!\" if the digit 7 appears in the array. Otherwise, return \"there is no 7 in the array\"",
    "link": "https://edabit.com/challenge/6R6gReGTGwzpwuffD",
    "tags": [ "Arrays", "Numbers", "Loops", "Regex" ]
  },
  {
    "title": "Tower of Hanoi",
    "description": "There are three towers. The objective of the game is to move all the disks over to tower #3, but you can't place a larger disk onto a smaller disk. Create a function that takes a number discs as an argument and returns the minimum amount of steps needed to complete the game.",
    "link": "https://edabit.com/challenge/3ZtykTsx3GSoPHyBb",
    "tags": [ "Algorithms", "Numbers", "Games", "Math" ]
  },
  {
    "title": "Number of Boomerangs",
    "description": "A boomerang is a V-shaped sequence that is either upright or upside down. Specifically, a boomerang can be defined as: sub-array of length 3, with the first and last digits being the same and the middle digit being different.",
    "link": "https://edabit.com/challenge/b7iHQDw72zzkmgCun",
    "tags": [ "Arrays", "Loops" ]
  },
  {
    "title": "Consecutive Sum Check",
    "description": "Create a function that takes a number as an argument and checks whether the given number can be expressed as a sum of two or more consecutive positive numbers.",
    "link": "https://edabit.com/challenge/KX4eJv6ZSJWsvtijd",
    "tags": [ "Bit operations", "Logic", "Math", "Numbers", "Validation" ]
  }
]
